### Broadcasting
* This concept is taken from NumPy.
* In pandas with this we can perform arithmetic operation betweem arrays or DF of different shapes.
* When we perform opearations between two objects with different shapes, pandas automatically aligns the objects based on their dimensions and applies the operation element-wise.
* `Element-wise` refers to performing an operation on each individual elements of a data structure or array.

In [1]:
import pandas as pd

In [2]:
data1 = pd.Series(data=[1,2,3])
data2= pd.Series(data=[2,3,4])

# Below will do Element wise operation, like: 1+2, 2+3, 3+4
data1 + data2

0    3
1    5
2    7
dtype: int64

In [3]:
# Even arrays are of different sizes it is going to adapt without any errors.
data3 = pd.Series(data=[10,20,30,40])

data1 + data3 # but we would get 4th value as NaN

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

This also goes for DataFrames

In [4]:
df1 = pd.DataFrame(data = {
    'a': [1,2],
    'b': [5,6]
})

df2 = pd.DataFrame(data={
    'a': [10,20],
    'b': [50,60]
})

df1 + df2

    a   b
0  11  55
1  22  66

In [6]:
df3 = pd.DataFrame(data={
    'a': [10,20, 40],
    'b': [50,60, 20]
})
df3

    a   b
0  10  50
1  20  60
2  40  20

In [7]:
df3 + df1

      a     b
0  11.0  55.0
1  22.0  66.0
2   NaN   NaN

So, above were element wise operations